[
    {
        "company": "BairesDev LLC",
        "position": "Senior Software Engineer (Go, Rust)",
        "location": "Remote, US",
        "from": "10-2022",
        "to": "",
        "short_description": "Manage and enhance partner system integrations based on their requirements.",
        "description": [
            "Led and mentored mid-level and senior engineers to accelerate team integration and boost their proficiency with core system functionality.",
            "Improved data verification and increased testing velocity by engineering developer tooling in Rust to automate AWS S3 and DynamoDB data workflows. This tool was rapidly adopted and integrated into the development workflow and CI/CD pipeline.",
            "Engineered the complete foundational infrastructure, development lifecycle, and tooling for a new partner integration, ensuring the secure, reliable display of energy plans.",
            "Defined project scope and requirements by conducting in-depth reviews of partner API documentation, understanding the technical requirements, and coordinating cross-organizational meetings."
        ]
    },
    {
        "company": "Quickplay",
        "position": "Senior Software Engineer (Go)",
        "location": "Remote, Canada",
        "from": "08-2021",
        "to": "09-2022",
        "short_description": "Maintained and enhanced a microservices-based video-on-demand (VOD) platform.",
        "description": [
            "Led new coworkers through the end-to-end VOD encoding pipeline training and comprehensive quality assurance process, directly reducing team ramp-up time and increasing overall productivity.",
            "Optimized the codebase for core VOD processing services (Audio, Video, Subtitles, Media Assets, and DRM) to ensure compliance with multiple VOD delivery standards and improve encoding quality consistency.",
            "Implemented comprehensive automated testing within the CI/CD framework, enforcing quality control for microservice deployments and preventing issues from reaching production.",
            "Applied continuous static code analysis and refactoring, improving average code quality scores on the VOD platform microservices."
        ]
    },
    {
        "company": "Land Gorilla LLC",
        "position": "Software Engineer",
        "location": "Remote, US",
        "from": "10-2019",
        "to": "08-2021",
        "short_description": "Optimized loan management system and on-site inspection APIs with enhanced security.",
        "description": [
            "Architected and deployed a private API for construction loan management, integrating on-site inspection functionality and adhering to the Open API Specification (OAS) and architecture's best practices principles.",
            "Significantly optimized API call efficiency for credential management, resulting in a 50% reduction in CPU usage."
        ]
    },
    {
        "company": "Freelancer",
        "position": "Software Engineer",
        "location": "Onsite, Peru",
        "from": "01-2018",
        "to": "09-2019",
        "short_description": "Built secure, efficient APIs for government health and agriculture offices.",
        "description": [
            "Architected a private REST API to significantly improve the efficiency of documentary procedures for the Government Health Office. The solution enhanced internal workflow and information management.",
            "Created a private API for the Government Agriculture Office to register and monitor farming production metrics, including seed-time, harvest data, and livestock farming activities."
        ]
    },
    {
        "company": "2Triangle",
        "position": "Software Engineer",
        "location": "Remote, Brazil",
        "from": "01-2017",
        "to": "12-2017",
        "short_description": "Developed a construction ERP to ensure item quantity and quality accountability.",
        "description": [
            "Designed and built the core functionality of an ERP web application that manages end-to-end construction projects, specifically controlling the quantities and quality standards for every build item."
        ]
    },
    {
        "company": "Ware Digital",
        "position": "Software Engineer",
        "location": "Onsite, Brazil",
        "from": "03-2016",
        "to": "12-2016",
        "short_description": "Implement web application to streamline the management of patient orders.",
        "description": [
            "Architected a comprehensive web-based platform for managing patient orders and clinical results, including configuring and securing the necessary cloud infrastructure."
        ]
    }
]