[
    {
        "company": "BairesDev LLC",
        "position": "Senior Software Engineer (Go, Rust)",
        "location": "Remote, US",
        "from": "10-2022",
        "to": "",
        "short_description": "Manage and enhance partner system integrations based on their requirements.",
        "description": [
            "Led and mentored mid-level and senior engineers to accelerate team integration and boost their proficiency with core system functionality.",
            "Engineered developer tooling in Rust to automate AWS S3 and DynamoDB data workflows, which improved data verification and increased testing velocity. This tool was rapidly adopted and integrated into the development workflow and CI/CD pipeline.",
            "Engineered the complete foundational infrastructure, development lifecycle, and tooling for a new partner integration, ensuring the secure, reliable display of energy plans.",
            "Defined project scope and requirements by conducting in-depth reviews of partner API documentation, understanding the technical requirements, and coordinating cross-organizational meetings."
        ]
    },
    {
        "company": "Quickplay",
        "position": "Senior Software Engineer (Go)",
        "location": "Remote, Canada",
        "from": "08-2021",
        "to": "09-2022",
        "short_description": "Maintained and enhanced a microservices-based video-on-demand (VOD) platform.",
        "description": [
            "Led new coworkers through the end-to-end VOD encoding pipeline training and comprehensive quality assurance process, directly reducing team ramp-up time and increasing overall productivity.",
            "Maintained the current codebase for core VOD processing services (Audio, Video, Subtitles, Media Assets, and DRM) and monitored system health to ensure continuous and stable operation.",
            "Implemented comprehensive automated testing within the CI/CD framework, enforcing quality control for microservice deployments and preventing issues from reaching production.",
            "Applied continuous static code analysis and refactoring, improving average code quality scores on the VOD platform microservices."
        ]
    },
    {
        "company": "Land Gorilla LLC",
        "position": "Software Engineer",
        "location": "Remote, US",
        "from": "10-2019",
        "to": "08-2021",
        "short_description": "Optimized loan management system and on-site inspection APIs with enhanced security.",
        "description": [
            "Architected and deployed a private API for construction loan management, integrating on-site inspection functionality and adhering to the Open API Specification and architecture's best practices principles.",
            "Significantly optimized API call efficiency for credential management, resulting in a 50% reduction in CPU usage."
        ]
    }
]